src/Documents/БезвозмездноеПоступлениеТМЦОтОрганизаций/БезвозмездноеПоступлениеТМЦОтОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БезвозмездноеПоступлениеТМЦОтОрганизаций</name>
  <registerRecords>AccountingRegister.ЖурналОпераций</registerRecords>
  <tabularSections>
    <name>ТМЦТЧ</name>
    <attributes>
      <name>ВидТМЦ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконто</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦ</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.СписокТоваровИУслуг</types>
        <types>CatalogRef.ОсновныеСредства</types>
        <types>CatalogRef.РасчетныеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccountingRegisters/ЖурналОпераций/ЖурналОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>ЖурналОпераций</name>
  <chartOfAccounts>ChartOfAccounts.ХозрасчетныйПлан</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.ХозрасчетныйПлан.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.ХозрасчетныйПлан.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.ХозрасчетныйПлан.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/Enums/ВидыТМЦ/ВидыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТМЦ</name>
  <enumValues>
    <name>ОсновныеСредства</name>
  </enumValues>
  <enumValues>
    <name>РасчетныйСчет</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
</mdclass:Enum>

src/ChartsOfAccounts/ХозрасчетныйПлан/ХозрасчетныйПлан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>ХозрасчетныйПлан</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>ОсновныеСредства</name>
      <description>Основные средства</description>
      <code>01</code>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>10</code>
    </items>
    <items>
      <name>РасчетныйСчет</name>
      <description>Рсчетный счет</description>
      <code>51</code>
    </items>
    <items>
      <name>БезвозмездноеПоступление</name>
      <description>Безвозмездное поступление</description>
      <code>98</code>
      <accountType>Passive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.СписокТоваровИУслуг</types>
    <types>CatalogRef.ОсновныеСредства</types>
    <types>String</types>
    <types>CatalogRef.РасчетныеСчета</types>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>Контрагент</name>
      <description>Контрагент</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.СписокТоваровИУслуг</types>
      </type>
    </items>
    <items>
      <name>ОсновныеСредства</name>
      <description>Основные средства</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>РасчетныйСчет</name>
      <description>Расчетный счет</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.РасчетныеСчета</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

src/Documents/БезвозмездноеПоступлениеТМЦОтОрганизаций/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ                                           	
	Для Каждого ТекСтрокаТМЦ Из ТМЦТЧ Цикл   
		Движение = Движения.ЖурналОпераций.Добавить();
		Движение.Период = Дата;                                        
		Если Строка(ТекСтрокаТМЦ.ВидТМЦ)=Строка(Перечисления.ВидыТМЦ.ОсновныеСредства) Тогда
			Движение.СчетДт=ПланыСчетов.ХозрасчетныйПлан.ОсновныеСредства;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства]=ТекСтрокаТМЦ.ТМЦ;
			Движение.КоличествоДт=ТекСтрокаТМЦ.Количество;
			Движение.Комментарий="Безвозмездное поступление ОС";
		ИначеЕсли Строка(ТекСтрокаТМЦ.ВидТМЦ)=Строка(Перечисления.ВидыТМЦ.Номенклатура) Тогда   
			сообщить(ТекСтрокаТМЦ.ВидТМЦ);
			Движение.СчетДт=ПланыСчетов.ХозрасчетныйПлан.Номенклатура;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура]=ТекСтрокаТМЦ.ТМЦ;
			Движение.КоличествоДт=ТекСтрокаТМЦ.Количество;
			Движение.Комментарий="Безвозмездное поступление номенклатуры";
		ИначеЕсли Строка(ТекСтрокаТМЦ.ВидТМЦ)=Строка(Перечисления.ВидыТМЦ.РасчетныйСчет) Тогда
			Движение.СчетДт=ПланыСчетов.ХозрасчетныйПлан.РасчетныйСчет;	
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.РасчетныйСчет]=ТекСтрокаТМЦ.ТМЦ;
			Движение.Комментарий="Безвозмездное посутпление денежных средств";
		КонецЕСли;
		Движение.СчетКт=ПланыСчетов.ХозрасчетныйПлан.БезвозмездноеПоступление; 
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент]=ТекСтрокаТМЦ.Контрагент;
		Движение.Сумма = ТекСтрокаТМЦ.Стоимость;
	КонецЦикла;
	// записываем движения регистров
	Движения.ЖурналОпераций.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
